; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v6 - type_2 ?v8 - type_1)
 	      (pred_1 ?v5 - object ?v8 - type_1)
	      (pred_2 ?v6 - type_2 ?v3 - type_3)
	      (pred_4 ?v6 - type_2 ?v5 - object ?v3 - type_3))

   (:action op_1
       :parameters  (?v6 - type_2 ?v2 ?v1 - type_1)
       :precondition (and  (pred_3 ?v6 ?v2))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v2))))

   (:action op_2
       :parameters (?v6 - type_2 ?v4 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v7) (pred_3 ?v6 ?v7) (pred_2 ?v6 ?v3))
       :effect (and (pred_4 ?v6 ?v4 ?v3)
		    (not (pred_1 ?v4 ?v7)) 
		    (not (pred_2 ?v6 ?v3))))

   (:action op_3
       :parameters (?v6 - type_2 ?v4 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v4 ?v3) (pred_3 ?v6 ?v7))
       :effect (and (pred_1 ?v4 ?v7)
		    (pred_2 ?v6 ?v3)
		    (not (pred_4 ?v6 ?v4 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_2
obj_02 obj_06 - type_3
obj_03 obj_09 obj_10 obj_07 - type_1
obj_04 obj_01 obj_08 - object)
(:init
(pred_3 obj_05 obj_07)
(pred_2 obj_05 obj_02)
(pred_2 obj_05 obj_06)
(pred_1 obj_04 obj_09)
(pred_1 obj_01 obj_09)
(pred_1 obj_08 obj_10)
)
(:goal
(and
(pred_1 obj_04 obj_03)
(pred_1 obj_01 obj_07)
(pred_1 obj_08 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_05 ?b obj_06))))
)
)

; plan
1. (op_1 obj_05 obj_07 obj_09)
   deleted: (pred_3 obj_05 obj_07)
   added: (pred_3 obj_05 obj_09)
   goals met: 0 of 3
2. (op_2 obj_05 obj_04 obj_09 obj_02)
   deleted: (pred_1 obj_04 obj_09) (pred_2 obj_05 obj_02)
   added: (pred_4 obj_05 obj_04 obj_02)
   goals met: 0 of 3
3. (op_1 obj_05 obj_09 obj_03)
   deleted: (pred_3 obj_05 obj_09)
   added: (pred_3 obj_05 obj_03)
   goals met: 0 of 3
4. (op_3 obj_05 obj_04 obj_03 obj_02)
   deleted: (pred_4 obj_05 obj_04 obj_02)
   added: (pred_1 obj_04 obj_03) (pred_2 obj_05 obj_02)
   goals met: 1 of 3
5. (op_1 obj_05 obj_03 obj_10)
   deleted: (pred_3 obj_05 obj_03)
   added: (pred_3 obj_05 obj_10)
   goals met: 1 of 3
6. (op_2 obj_05 obj_08 obj_10 obj_02)
   deleted: (pred_1 obj_08 obj_10) (pred_2 obj_05 obj_02)
   added: (pred_4 obj_05 obj_08 obj_02)
   goals met: 1 of 3
7. (op_1 obj_05 obj_10 obj_07)
   deleted: (pred_3 obj_05 obj_10)
   added: (pred_3 obj_05 obj_07)
   goals met: 1 of 3
8. (op_3 obj_05 obj_08 obj_07 obj_02)
   deleted: (pred_4 obj_05 obj_08 obj_02)
   added: (pred_1 obj_08 obj_07) (pred_2 obj_05 obj_02)
   goals met: 2 of 3
9. (op_1 obj_05 obj_07 obj_09)
   deleted: (pred_3 obj_05 obj_07)
   added: (pred_3 obj_05 obj_09)
   goals met: 2 of 3
10. (op_2 obj_05 obj_01 obj_09 obj_02)
   deleted: (pred_1 obj_01 obj_09) (pred_2 obj_05 obj_02)
   added: (pred_4 obj_05 obj_01 obj_02)
   goals met: 2 of 3
11. (op_1 obj_05 obj_09 obj_07)
   deleted: (pred_3 obj_05 obj_09)
   added: (pred_3 obj_05 obj_07)
   goals met: 2 of 3
12. (op_3 obj_05 obj_01 obj_07 obj_02)
   deleted: (pred_4 obj_05 obj_01 obj_02)
   added: (pred_1 obj_01 obj_07) (pred_2 obj_05 obj_02)
   goals met: 3 of 3
